tap "anomalyco/tap"
tap "azure/azd"
tap "azure/functions"
tap "ubuntu/microk8s"
brew "atuin"
brew "azcopy"
brew "azure-cli"
brew "bash"
brew "bat"
brew "btop"
brew "libpng"
brew "cairo"
brew "ctop"
brew "docker"
brew "eza"
brew "fd"
brew "fzf"
brew "gawk"
brew "gemini-cli"
brew "giflib"
brew "git-lfs"
brew "gnu-sed"
brew "go"
brew "helm"
brew "htop"
brew "httpie"
brew "iproute2mac"
brew "jd"
brew "jpeg"
brew "jq"
brew "k6"
brew "kind"
brew "kubernetes-cli"
brew "libpq", link: true
brew "pango"
brew "librsvg"
brew "lsd"
brew "maven"
brew "mongosh"
brew "n"
brew "nali"
brew "neovim"
brew "nmap"
brew "openjdk@17"
brew "pipenv"
brew "pkgconf"
brew "pnpm"
brew "poppler"
brew "pyenv"
brew "python-setuptools"
brew "ripgrep"
brew "rust"
brew "serie"
brew "starship"
brew "telnet"
brew "terraform"
brew "tldr"
brew "tmux"
brew "tre-command"
brew "tree"
brew "trurl"
brew "unar"
brew "uv"
brew "watch"
brew "wget"
brew "xh"
brew "yamllint"
brew "yarn"
brew "yazi"
brew "yq"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "anomalyco/tap/opencode"
brew "azure/azd/azd"
brew "azure/functions/azure-functions-core-tools@4"
cask "antigravity"
cask "cheatsheet"
cask "claude-code"
cask "codex"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-maple-mono-nf"
cask "font-maple-mono-nf-cn"
cask "font-monaspace"
cask "font-symbols-only-nerd-font"
cask "ghostty"
cask "httpie-desktop"
cask "multipass"
cask "notion"
cask "obsidian"
cask "orbstack"
cask "pgadmin4"
cask "postman"
cask "pronotes"
cask "rectangle"
cask "shottr"
vscode "aaron-bond.better-comments"
vscode "avetis.tokyo-night"
vscode "beardedbear.beardedtheme"
vscode "bmalehorn.shell-syntax"
vscode "bwya77.islands-dark"
vscode "csstools.postcss"
vscode "dbaeumer.vscode-eslint"
vscode "dbankier.vscode-instant-markdown"
vscode "drcika.apc-extension"
vscode "esbenp.prettier-vscode"
vscode "github.copilot-chat"
vscode "kamikillerto.vscode-colorize"
vscode "l-igh-t.vscode-theme-seti-folder"
vscode "mads-hartmann.bash-ide-vscode"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-bicep"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-vscode.azurecli"
vscode "redhat.vscode-yaml"
vscode "subframe7536.custom-ui-style"
vscode "sumneko.lua"
vscode "tamasfe.even-better-toml"
vscode "vscodevim.vim"
vscode "wayou.vscode-todo-highlight"
vscode "yoavbls.pretty-ts-errors"
go "github.com/cosmtrek/air"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"
go "github.com/thegeeklab/url-parser/cmd/url-parser"
